Reports/А_ПланФактныйПроизводствоПолный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>А_ПланФактныйПроизводствоПолный</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/А_ДанныеТабелирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>А_ДанныеТабелирования</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЧасыПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧасыФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.А_СотрудникиКазна</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.А_СотрудникиКазна</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/А_ВыполнениеРаботМодулей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>А_ВыполнениеРаботМодулей</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЧасыВыполнение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктураСебестоимости</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.А_СтруктураСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерМодуля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.А_ЭтапыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/РазделыУчетаСебестоимостиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>РазделыУчетаСебестоимостиТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТоварыНаСкладах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыПереданныеНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводственныеЗатраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыПереданныеПереработчику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыПринятыеНаКомиссию</Name>
					<Comment>Товары, принятые на комиссию</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериалыПринятыеВПереработку</Name>
					<Comment>Материалы, принятые в переработку</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыНаХраненииСПравомПродажи</Name>
					<Comment>Товары, принятые на ответственное хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыПринятыеНаОтветхранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НезавершенноеПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственныеТоварыВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеотфактурованныеПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственныеТоварыПереданныеПартнерам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыНаХраненииСПравомПродажиПереданныеПартнерам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыНаХраненииСПравомПродажиКОформлениюСписания</Name>
					<Comment>Товары, принятые на ответственное хранение, к оформлению списания</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/А_СтруктураСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>А_СтруктураСебестоимости</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПроизводство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладМонтаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_КоличествоМодулей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗастосовуватиПеревіркуОдиниць</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДомов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбщееНазвание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.А_ОбщиеНазванияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.А_ЭтапыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаВыезде</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураСС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаСС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеСовпадает</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбщееНазвание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.А_ЭтапыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаВыезде</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/А_ПланФактныйПроизводствоПолный/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Внешний отчёт А_ПланФактныйПроизводствоПолный.
// «Звіт виробництва по табелях» — программная компоновка СКД (ПриКомпоновкеРезультата):
// данные строит ObjectModule (ПолучитьДанные), затем передаются в СКД как внешний набор "Детали".
// Причина программной компоновки: маппинг факт-материалів на Етап через
// Номенклатура.А_ОбщееНазваниеНоменклатуры невозможен в запросе СКД на этой базе (1С-квирк
// с соединением по справочнику А_ОбщиеНазванияНоменклатуры), делается в BSL через Соответствие.
// Источники проверены Python-COM (Rule #-1).

#Область СлужебныйПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = Новый Структура;
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("");

	ИмяОтчета = Метаданные().Представление();

	ПараметрыРегистрации.Вставить("Вид", "ДополнительныйОтчет");
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", ИмяОтчета);
	ПараметрыРегистрации.Вставить("Версия", "3.0");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
	ПараметрыРегистрации.Вставить("Информация", "Виробництво: план-факт за структурою собівартості (з розшифровкою)");

	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, ИмяОтчета, Метаданные().ПолноеИмя(), "ОткрытиеФормы", Истина);
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);

	Возврат ПараметрыРегистрации;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Программная компоновка: данные готовятся в ПолучитьДанные и передаются в СКД
// как внешний набор данных "Детали". Расшифровка штатная (ДанныеРасшифровки прокидывается).
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	УстановитьПривилегированныйРежим(Истина);

	Настройки = КомпоновщикНастроек.ПолучитьНастройки();

	Период = ПолучитьЗначениеПараметра(КомпоновщикНастроек, "Период");

	ТаблицаДетали = ПолучитьДанные(Период);

	ВнешниеНаборыДанных = Новый Структура("Детали", ТаблицаДетали);

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Главный сбор данных: строит плоскую ТЗ грейна по ВСЕМ активным структурам себестоимости
// каждого подразделения; СКД-отбор «Подразделение»/«ПодразделениеОбъекта» затем фильтрует нужные.
// Факт-материали = ЗАКУПКИ (СебестоимостьТоваров.Приход/ПриобретениеТоваровУслуг по ПодразделениеЗакупки
// В ИЕРАРХИИ), факт табеля — по ИЕРАРХИИ подразделения СС. Чтобы факт НЕ ДВОИЛСЯ при нескольких активных
// СС в подразделении, фактовые ветки соединяются с ВТ_Подр1 (ОДНА строка на подразделение),
// плановые/EV — с ВТ_СС (per-СС). «Подразделение» у всех строк = СС.Подразделение; «ПодразделениеОбъекта»
// (15м/30м) заполнен только у плана/EV, у факта пуст (котёл — на итоге подразделения).
Функция ПолучитьДанные(Период) Экспорт

	Если ЗначениеЗаполнено(Период) И ЗначениеЗаполнено(Период.ДатаНачала) Тогда
		НачП = Период.ДатаНачала;
	Иначе
		НачП = '00010101000000';
	КонецЕсли;
	Если ЗначениеЗаполнено(Период) И ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		КонП = КонецДня(Период.ДатаОкончания);
	Иначе
		КонП = '39991231235959';
	КонецЕсли;

	ТЗ = СоздатьПустуюТаблицу();

	ЗапросПодразделений = Новый Запрос;
	ЗапросПодразделений.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СС.Подразделение КАК Подразделение
	|ИЗ
	|	Справочник.А_СтруктураСебестоимости КАК СС
	|ГДЕ
	|	НЕ СС.ЭтоГруппа
	|	И СС.Активная
	|	И СС.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)";
	ВыборкаПодразделений = ЗапросПодразделений.Выполнить().Выбрать();

	Пока ВыборкаПодразделений.Следующий() Цикл
		Департамент = ВыборкаПодразделений.Подразделение;
		ТЗЧасть = ВыполнитьЗапросПоПодразделению(Департамент, НачП, КонП);
		ЗаполнитьЭтапФактМатериалов(ТЗЧасть, Департамент);
		Для Каждого СтрокаЧасти Из ТЗЧасть Цикл
			ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), СтрокаЧасти);
		КонецЦикла;
	КонецЦикла;

	ЗаполнитьПланНаФакт(ТЗ);

	Возврат ТЗ;

КонецФункции

// Запрос грейна по ОДНОМУ подразделению (&Подр). План/EV — по ВТ_СС (все активные СС подразделения),
// факт (табель/закупки) — по ВТ_Подр1 (одна строка на подразделение), чтобы не двоить факт.
Функция ВыполнитьЗапросПоПодразделению(Департамент, НачП, КонП)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подр", Департамент);
	Запрос.УстановитьПараметр("НачП", НачП);
	Запрос.УстановитьПараметр("КонП", КонП);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СС.Ссылка КАК СС,
	|	СС.Подразделение КАК Подр,
	|	СС.ПодразделениеОбъекта КАК ПодрОбъекта,
	|	ВЫБОР
	|		КОГДА СС.ПодразделениеЗакупки <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА СС.ПодразделениеЗакупки
	|		ИНАЧЕ СС.Подразделение
	|	КОНЕЦ КАК ПодрЗакуп,
	|	ВЫБОР КОГДА СС.КоличествоДомов > 0 ТОГДА СС.КоличествоДомов ИНАЧЕ 1 КОНЕЦ КАК Домов
	|ПОМЕСТИТЬ ВТ_СС
	|ИЗ
	|	Справочник.А_СтруктураСебестоимости КАК СС
	|ГДЕ
	|	СС.Подразделение = &Подр
	|	И НЕ СС.ЭтоГруппа
	|	И СС.Активная
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_СС.Подр КАК Подр
	|ПОМЕСТИТЬ ВТ_Подр1
	|ИЗ
	|	ВТ_СС КАК ВТ_СС
	|;
	|ВЫБРАТЬ
	|	Р.Работа КАК Работа,
	|	МАКСИМУМ(Р.НаВыезде) КАК НаВыезде
	|ПОМЕСТИТЬ ВТ_РаботыСС
	|ИЗ
	|	Справочник.А_СтруктураСебестоимости.Работы КАК Р
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СС КАК ВТ_СС
	|		ПО Р.Ссылка = ВТ_СС.СС
	|СГРУППИРОВАТЬ ПО
	|	Р.Работа
	|;
	|ВЫБРАТЬ
	|	ВТ_СС.Подр КАК Подразделение,
	|	ВТ_СС.ПодрОбъекта КАК ПодразделениеОбъекта,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеИсполнитель,
	|	""1. Праця"" КАК Блок,
	|	ВЫБОР КОГДА Р.НаВыезде ТОГДА ""Монтаж"" ИНАЧЕ ""Виробництво"" КОНЕЦ КАК Категория,
	|	Р.Этап КАК Этап,
	|	Р.Работа КАК Работа,
	|	ЗНАЧЕНИЕ(Справочник.А_ОбщиеНазванияНоменклатуры.ПустаяСсылка) КАК ОбщееНазвание,
	|	НЕОПРЕДЕЛЕНО КАК Документ,
	|	Р.Работа КАК Аналитика,
	|	"""" КАК НоменклатураНаименование,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Единица,
	|	Р.Количество * ВТ_СС.Домов КАК ПланЧасы,
	|	0 КАК ФактЧасы,
	|	0 КАК ВиконанняЧасы,
	|	0 КАК ПланКол,
	|	0 КАК ФактКол,
	|	0 КАК ПланГрн,
	|	0 КАК ФактГрн
	|ПОМЕСТИТЬ ВТ_Детали
	|ИЗ
	|	Справочник.А_СтруктураСебестоимости.Работы КАК Р
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СС КАК ВТ_СС
	|		ПО Р.Ссылка = ВТ_СС.СС
	|ГДЕ
	|	СокрЛП(Р.Единица.Наименование) = ""чол/год""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_СС.Подр,
	|	ВТ_СС.ПодрОбъекта,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	""2. Матеріали"",
	|	ВЫБОР КОГДА К.Этап.Наименование ПОДОБНО ""%Монтаж%"" ТОГДА ""Монтаж"" ИНАЧЕ ""Виробництво"" КОНЕЦ,
	|	К.Этап,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	К.ОбщееНазвание,
	|	К.Ссылка,
	|	СокрЛП(К.НоменклатураСС),
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	К.ЕдиницаОбщееНазвание,
	|	0,
	|	0,
	|	0,
	|	К.Количество * ВТ_СС.Домов,
	|	0,
	|	К.Сумма * ВТ_СС.Домов,
	|	0
	|ИЗ
	|	Справочник.А_СтруктураСебестоимости.Комплектующие КАК К
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СС КАК ВТ_СС
	|		ПО К.Ссылка = ВТ_СС.СС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Подр1.Подр,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	Т.Подразделение,
	|	""1. Праця"",
	|	""Виробництво"",
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.А_ОбщиеНазванияНоменклатуры.ПустаяСсылка),
	|	Т.Регистратор,
	|	Т.Сотрудник.СотрудникЕРП.ФизическоеЛицо,
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
	|	0,
	|	Т.ЧасыФакт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.А_ДанныеТабелирования КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Подр1 КАК ВТ_Подр1
	|		ПО ИСТИНА
	|ГДЕ
	|	Т.Подразделение В ИЕРАРХИИ (ВЫБРАТЬ ВТ_СС.Подр ИЗ ВТ_СС КАК ВТ_СС)
	|	И Т.Период МЕЖДУ &НачП И &КонП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Подр1.Подр,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	""2. Матеріали"",
	|	""Виробництво"",
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	СТ.АналитикаУчетаНоменклатуры.Номенклатура.А_ОбщееНазваниеНоменклатуры,
	|	ВЫРАЗИТЬ(СТ.Регистратор КАК Документ.ПриобретениеТоваровУслуг),
	|	СокрЛП(СТ.АналитикаУчетаНоменклатуры.Номенклатура.Наименование),
	|	СТ.АналитикаУчетаНоменклатуры.Номенклатура.Наименование,
	|	СТ.АналитикаУчетаНоменклатуры.Номенклатура,
	|	СТ.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СТ.Количество,
	|	0,
	|	СТ.Стоимость
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК СТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Подр1 КАК ВТ_Подр1
	|		ПО ИСТИНА
	|ГДЕ
	|	СТ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И СТ.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	И СТ.Регистратор ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|	И ВЫРАЗИТЬ(СТ.Регистратор КАК Документ.ПриобретениеТоваровУслуг).Подразделение В ИЕРАРХИИ (ВЫБРАТЬ ВТ_СС.ПодрЗакуп ИЗ ВТ_СС КАК ВТ_СС)
	|	И СТ.Период МЕЖДУ &НачП И &КонП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_СС.Подр,
	|	ВТ_СС.ПодрОбъекта,
	|	ВРМ.Подразделение,
	|	""1. Праця"",
	|	ВЫБОР КОГДА ЕСТЬNULL(РС.НаВыезде, ЛОЖЬ) ТОГДА ""Монтаж"" ИНАЧЕ ""Виробництво"" КОНЕЦ,
	|	ВРМ.Этап,
	|	ВРМ.Работа,
	|	ЗНАЧЕНИЕ(Справочник.А_ОбщиеНазванияНоменклатуры.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ВРМ.Работа,
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
	|	0,
	|	0,
	|	ВРМ.ЧасыВыполнение,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.А_ВыполнениеРаботМодулей КАК ВРМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СС КАК ВТ_СС
	|		ПО ВРМ.СтруктураСебестоимости = ВТ_СС.СС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаботыСС КАК РС
	|		ПО ВРМ.Работа = РС.Работа
	|ГДЕ
	|	ВРМ.Период МЕЖДУ &НачП И &КонП
	|;
	|ВЫБРАТЬ
	|	ВТ_Детали.Подразделение КАК Подразделение,
	|	ВТ_Детали.ПодразделениеОбъекта КАК ПодразделениеОбъекта,
	|	ВТ_Детали.ПодразделениеИсполнитель КАК ПодразделениеИсполнитель,
	|	ВТ_Детали.Блок КАК Блок,
	|	ВТ_Детали.Категория КАК Категория,
	|	ВТ_Детали.Этап КАК Этап,
	|	ВТ_Детали.Работа КАК Работа,
	|	ВТ_Детали.ОбщееНазвание КАК ОбщееНазвание,
	|	ВТ_Детали.Аналитика КАК Аналитика,
	|	ВТ_Детали.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ВТ_Детали.Номенклатура КАК Номенклатура,
	|	ВТ_Детали.Единица КАК Единица,
	|	ВТ_Детали.Документ КАК Документ,
	|	СУММА(ВТ_Детали.ПланЧасы) КАК ПланЧасы,
	|	СУММА(ВТ_Детали.ФактЧасы) КАК ФактЧасы,
	|	СУММА(ВТ_Детали.ВиконанняЧасы) КАК ВиконанняЧасы,
	|	СУММА(ВТ_Детали.ПланКол) КАК ПланКол,
	|	СУММА(ВТ_Детали.ФактКол) КАК ФактКол,
	|	СУММА(ВТ_Детали.ПланГрн) КАК ПланГрн,
	|	СУММА(ВТ_Детали.ФактГрн) КАК ФактГрн,
	|	СУММА(ВТ_Детали.ФактЧасы) - СУММА(ВТ_Детали.ПланЧасы) КАК ОтклонениеЧасы,
	|	СУММА(ВТ_Детали.ФактКол) - СУММА(ВТ_Детали.ПланКол) КАК ОтклонениеКол,
	|	СУММА(ВТ_Детали.ФактГрн) - СУММА(ВТ_Детали.ПланГрн) КАК ОтклонениеГрн,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ_Детали.ПланЧасы) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ВТ_Детали.ФактЧасы) / СУММА(ВТ_Детали.ПланЧасы) * 100
	|	КОНЕЦ КАК ПроцентЧасы,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ_Детали.ПланКол) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ВТ_Детали.ФактКол) / СУММА(ВТ_Детали.ПланКол) * 100
	|	КОНЕЦ КАК ПроцентКол,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ_Детали.ПланГрн) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ВТ_Детали.ФактГрн) / СУММА(ВТ_Детали.ПланГрн) * 100
	|	КОНЕЦ КАК ПроцентГрн,
	|	СУММА(ВТ_Детали.ФактЧасы) - СУММА(ВТ_Детали.ВиконанняЧасы) КАК ОтклонениеВиконання,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ_Детали.ПланЧасы) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ВТ_Детали.ВиконанняЧасы) / СУММА(ВТ_Детали.ПланЧасы) * 100
	|	КОНЕЦ КАК ПроцентВиконання,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ_Детали.ФактЧасы) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ВТ_Детали.ВиконанняЧасы) / СУММА(ВТ_Детали.ФактЧасы) * 100
	|	КОНЕЦ КАК ПроцентВиконанняФакт,
	|	0 КАК ПланНаФактГрн,
	|	СУММА(ВТ_Детали.ФактГрн) КАК ПрогнозГрн,
	|	СУММА(ВТ_Детали.ФактГрн) - СУММА(ВТ_Детали.ПланГрн) КАК ОтклонениеПрогнозГрн,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ_Детали.ПланГрн) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ВТ_Детали.ФактГрн) / СУММА(ВТ_Детали.ПланГрн) * 100
	|	КОНЕЦ КАК ПроцентПрогнозГрн,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ_Детали.ПланКол) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ВТ_Детали.ПланГрн) / СУММА(ВТ_Детали.ПланКол)
	|	КОНЕЦ КАК ЦенаПлан,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ_Детали.ФактКол) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ВТ_Детали.ФактГрн) / СУММА(ВТ_Детали.ФактКол)
	|	КОНЕЦ КАК ЦенаФакт
	|ИЗ
	|	ВТ_Детали КАК ВТ_Детали
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Детали.Подразделение,
	|	ВТ_Детали.ПодразделениеОбъекта,
	|	ВТ_Детали.ПодразделениеИсполнитель,
	|	ВТ_Детали.Блок,
	|	ВТ_Детали.Категория,
	|	ВТ_Детали.Этап,
	|	ВТ_Детали.Работа,
	|	ВТ_Детали.ОбщееНазвание,
	|	ВТ_Детали.Аналитика,
	|	ВТ_Детали.НоменклатураНаименование,
	|	ВТ_Детали.Номенклатура,
	|	ВТ_Детали.Единица,
	|	ВТ_Детали.Документ";

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Разнос факт-материалів (Блок="2. Матеріали", Етап пуст) по Етапу И Категорії:
// Номенклатура.А_ОбщееНазваниеНоменклатуры -> {Этап, Категория} из плана Комплектующие (через Соответствие).
// Категория Вир/Монт берётся по этапу — так же, как категоризируется план.
Процедура ЗаполнитьЭтапФактМатериалов(ТЗ, Департамент)

	Маппинг = МаппингОбщееНазваниеЭтап(Департамент);
	Если Маппинг.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаТЗ Из ТЗ Цикл
		Если СтрокаТЗ.Блок <> "2. Матеріали"
			ИЛИ ЗначениеЗаполнено(СтрокаТЗ.Этап)
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЗ.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		ОбщееНазвание = СтрокаТЗ.ОбщееНазвание;
		Если НЕ ЗначениеЗаполнено(ОбщееНазвание) Тогда
			Продолжить;
		КонецЕсли;
		// Ключ — по ИМЕНИ общего названия (нормализация пробелов), т.к. у А_ОбщиеНазванияНоменклатуры
		// есть дубли ссылок с одинаковым именем — сопоставление по ссылке не находит.
		Ключ = СокрЛП(ОбщееНазвание.Наименование);
		ДанныеЭтапа = Маппинг.Получить(Ключ);
		Если ДанныеЭтапа <> Неопределено Тогда
			СтрокаТЗ.Этап = ДанныеЭтапа.Этап;
			СтрокаТЗ.Категория = ДанныеЭтапа.Категория;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// «План на факт» (ETC) / «Прогноз» (EAC) по материалам — утверждённая методология:
// нетто ПланКол/ФактКол/ПланГрн/ФактГрн строго ПО ГРУППЕ (Подразделение, «Загальна назва»), stage/cat-agnostic;
// для строк БЕЗ общей назвы группа — сама Номенклатура (fallback, такие строки НЕ выбрасываются).
// Правила: 1) ФактКол=0 -> ПланНаФакт = ПланГрн группы РОВНО (без пересчёта цена*кол — копейка в копейку);
// 2) ФактКол>0 -> ПланНаФакт = Макс(0, ПланКол-ФактКол) * (ПланГрн/ПланКол);
// 4) ПланКол=0 при ПланГрн>0 -> стоимостное нетто Макс(0, ПланГрн-ФактГрн).
// (Ключ БЕЗ Этап/Категория — иначе перерасход одного этапа не гасит остаток плана в другом, ETC завышается.)
// Вставляет синтетическую строку «залишок плану» на этап/категорию плановой строки с макс. ПланГрн группы:
// с общей назвой — на уровень ОбщееНазвание (Аналитика/Единица — пустые ссылки, чтобы не плодить
// пустые строки в расшифровке), без назвы — на Номенклатуру плана (Аналитика/Единица — как у плана).
// Прогноз/Відхилення/% — totalField в схеме (Сумма(ФактГрн)+Сумма(ПланНаФактГрн) и т.д.).
Процедура ЗаполнитьПланНаФакт(ТЗ)

	ПустаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	ПустаяЕдиница = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	ПустойДокумент = Документы.ПриобретениеТоваровУслуг.ПустаяСсылка();

	Группы = Новый Соответствие;

	Для Каждого СтрокаТЗ Из ТЗ Цикл
		Если СтрокаТЗ.Блок <> "2. Матеріали" Тогда
			Продолжить;
		КонецЕсли;
		Ключ = КлючГруппыПланНаФакт(СтрокаТЗ);
		Группа = Группы.Получить(Ключ);
		Если Группа = Неопределено Тогда
			Группа = Новый Структура("ПланКол, ФактКол, ПланГрн, ФактГрн, МаксГрн", 0, 0, 0, 0, 0);
			Группа.Вставить("Подразделение", СтрокаТЗ.Подразделение);
			Группа.Вставить("ОбщееНазвание", СтрокаТЗ.ОбщееНазвание);
			Группа.Вставить("Аналитика", СтрокаТЗ.Аналитика);
			Группа.Вставить("Единица", СтрокаТЗ.Единица);
			Группа.Вставить("Категория", "Виробництво");
			Группа.Вставить("Этап", Неопределено);
			Группы.Вставить(Ключ, Группа);
		КонецЕсли;
		Группа.ПланКол = Группа.ПланКол + СтрокаТЗ.ПланКол;
		Группа.ФактКол = Группа.ФактКол + СтрокаТЗ.ФактКол;
		Группа.ПланГрн = Группа.ПланГрн + СтрокаТЗ.ПланГрн;
		Группа.ФактГрн = Группа.ФактГрн + СтрокаТЗ.ФактГрн;
		// Размещение синт.строки: этап/категория/ссылки плановой строки с макс. ПланГрн группы.
		Если СтрокаТЗ.ПланГрн > Группа.МаксГрн Тогда
			Группа.МаксГрн = СтрокаТЗ.ПланГрн;
			Группа.Категория = СтрокаТЗ.Категория;
			Группа.Этап = СтрокаТЗ.Этап;
			Группа.ОбщееНазвание = СтрокаТЗ.ОбщееНазвание;
			Группа.Аналитика = СтрокаТЗ.Аналитика;
			Группа.Единица = СтрокаТЗ.Единица;
		КонецЕсли;
	КонецЦикла;

	Для Каждого КлючИГруппа Из Группы Цикл
		Группа = КлючИГруппа.Значение;
		Если Группа.ПланГрн <= 0 Тогда
			Продолжить; // нет плановой стоимости — прогнозировать нечего
		КонецЕсли;
		Если Группа.ПланКол <= 0 Тогда
			// правило 4: план суммой без количества — стоимостное нетто
			ПланНаФакт = Макс(0, Группа.ПланГрн - Группа.ФактГрн);
		ИначеЕсли Группа.ФактКол <= 0 Тогда
			// правило 1: закупок нет — ровно сумма плана (никакой «игры с копейками» через цену)
			ПланНаФакт = Группа.ПланГрн;
		Иначе
			// правило 2: остаток некупленного количества * средняя плановая цена группы
			Залишок = Макс(0, Группа.ПланКол - Группа.ФактКол);
			ПланНаФакт = Залишок * (Группа.ПланГрн / Группа.ПланКол);
		КонецЕсли;
		Если ПланНаФакт <= 0 Тогда
			Продолжить;
		КонецЕсли;
		СинтСтрока = ТЗ.Добавить();
		СинтСтрока.Подразделение = Группа.Подразделение;
		СинтСтрока.ПодразделениеИсполнитель = Справочники.СтруктураПредприятия.ПустаяСсылка();
		СинтСтрока.Блок = "2. Матеріали";
		СинтСтрока.Категория = Группа.Категория;
		СинтСтрока.Этап = Группа.Этап;
		СинтСтрока.ОбщееНазвание = Группа.ОбщееНазвание;
		СинтСтрока.Номенклатура = ПустаяНоменклатура;
		Если ЗначениеЗаполнено(Группа.ОбщееНазвание) Тогда
			СинтСтрока.Аналитика = "";
			СинтСтрока.Единица = ПустаяЕдиница;
		Иначе
			СинтСтрока.Аналитика = Группа.Аналитика;
			СинтСтрока.Единица = Группа.Единица;
		КонецЕсли;
		СинтСтрока.Работа = ПустаяНоменклатура;
		СинтСтрока.Документ = ПустойДокумент;
		СинтСтрока.ПланНаФактГрн = ПланНаФакт;
		СинтСтрока.ПрогнозГрн = ПланНаФакт;
		СинтСтрока.ОтклонениеПрогнозГрн = ПланНаФакт;
	КонецЦикла;

КонецПроцедуры

// Строковый ключ нетто-группы «План на факт»: Подразделение + нормализованное ИМЯ общей назвы
// (у А_ОбщиеНазванияНоменклатуры есть дубли карточек с одним именем — сопоставление по ссылке не находит);
// при пустой общей назве — fallback: факт (Аналитика-ссылка) — по Номенклатуре, план материалов
// (Аналитика-строка НоменклатураСС) — по нормализованному ТЕКСТУ (позиции не слипаются между собой).
// ⚠️ Известное ограничение (FINDINGS §19): план-строка с карточкой БЕЗ карточного ОН не сойдётся
// с факт-закупкой той же номенклатуры (у плана нет ссылки) — лечится заполнением ОН в карточке.
Функция КлючГруппыПланНаФакт(СтрокаТЗ)

	КлючПодр = Строка(СтрокаТЗ.Подразделение.УникальныйИдентификатор()) + "|";
	Если ЗначениеЗаполнено(СтрокаТЗ.ОбщееНазвание) Тогда
		ИмяОН = СокрЛП(СтрокаТЗ.ОбщееНазвание.Наименование);
		Если ИмяОН = "" Тогда
			ИмяОН = Строка(СтрокаТЗ.ОбщееНазвание.УникальныйИдентификатор());
		КонецЕсли;
		Возврат КлючПодр + "ОН|" + ИмяОН;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаТЗ.Номенклатура) Тогда
		Возврат КлючПодр + "НОМ|" + Строка(СтрокаТЗ.Номенклатура.УникальныйИдентификатор());
	КонецЕсли;
	Если ТипЗнч(СтрокаТЗ.Аналитика) = Тип("Строка") И СокрЛП(СтрокаТЗ.Аналитика) <> "" Тогда
		Возврат КлючПодр + "НОМТЕКСТ|" + ВРег(СокрЛП(СтрокаТЗ.Аналитика));
	КонецЕсли;
	Возврат КлючПодр + "НОМ|";

КонецФункции

// Соответствие ИМЯ общего названия (нормализованное) -> Структура{Этап, Категория} (макс. этап при нескольких).
// Ключ строковый (не ссылка): дубли ссылок А_ОбщиеНазванияНоменклатуры с одним именем.
// Карта строится по ВСЕМ СС с тем же именем (дубли карточек СС объединяются).
// Категория Вир/Монт вычисляется по имени этапа ТЕМ ЖЕ выражением, что и план (ПОДОБНО "%Монтаж%").
Функция МаппингОбщееНазваниеЭтап(Департамент)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Департамент", Департамент);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	К.ОбщееНазвание.Наименование КАК ОбщееНазвание,
	|	К.Этап КАК Этап,
	|	ВЫБОР КОГДА К.Этап.Наименование ПОДОБНО ""%Монтаж%"" ТОГДА ""Монтаж"" ИНАЧЕ ""Виробництво"" КОНЕЦ КАК Категория
	|ИЗ
	|	Справочник.А_СтруктураСебестоимости.Комплектующие КАК К
	|ГДЕ
	|	К.Ссылка.Подразделение = &Департамент
	|	И К.Ссылка.Активная
	|	И НЕ К.Ссылка.ЭтоГруппа
	|	И К.ОбщееНазвание <> ЗНАЧЕНИЕ(Справочник.А_ОбщиеНазванияНоменклатуры.ПустаяСсылка)
	|	И К.Этап <> ЗНАЧЕНИЕ(Справочник.А_ЭтапыРабот.ПустаяСсылка)";

	Маппинг = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ключ = СокрЛП(Выборка.ОбщееНазвание);
		Если НЕ ЗначениеЗаполнено(Ключ) Тогда
			Продолжить;
		КонецЕсли;
		Текущий = Маппинг.Получить(Ключ);
		Если Текущий = Неопределено ИЛИ Строка(Выборка.Этап) > Строка(Текущий.Этап) Тогда
			Маппинг.Вставить(Ключ, Новый Структура("Этап, Категория", Выборка.Этап, Выборка.Категория));
		КонецЕсли;
	КонецЦикла;
	Возврат Маппинг;

КонецФункции

// Пустая ТЗ грейна (типы колонок = полям внешнего набора "Детали" схемы СКД).
Функция СоздатьПустуюТаблицу()

	ТЗ = Новый ТаблицаЗначений;
	ОписЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписСтрока50 = Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50));
	ОписСтрока150 = Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(150));
	МассивАналитика = Новый Массив;
	МассивАналитика.Добавить(Тип("СправочникСсылка.Номенклатура"));
	МассивАналитика.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
	МассивАналитика.Добавить(Тип("Строка")); // план материалов = текст НоменклатураСС (ТЧ, Excel)
	МассивДокумент = Новый Массив;
	МассивДокумент.Добавить(Тип("ДокументСсылка.ПриобретениеТоваровУслуг"));
	МассивДокумент.Добавить(Тип("СправочникСсылка.А_СтруктураСебестоимости"));
	МассивДокумент.Добавить(Тип("ДокументСсылка.А_ТабельУчетаРабочегоВремени"));

	ТЗ.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	ТЗ.Колонки.Добавить("ПодразделениеОбъекта", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	ТЗ.Колонки.Добавить("ПодразделениеИсполнитель", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	ТЗ.Колонки.Добавить("Блок", ОписСтрока50);
	ТЗ.Колонки.Добавить("Категория", ОписСтрока50);
	ТЗ.Колонки.Добавить("Этап", Новый ОписаниеТипов("СправочникСсылка.А_ЭтапыРабот"));
	ТЗ.Колонки.Добавить("Работа", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("ОбщееНазвание", Новый ОписаниеТипов("СправочникСсылка.А_ОбщиеНазванияНоменклатуры"));
	ТЗ.Колонки.Добавить("Аналитика", Новый ОписаниеТипов(МассивАналитика, , Новый КвалификаторыСтроки(200)));
	ТЗ.Колонки.Добавить("НоменклатураНаименование", ОписСтрока150);
	ТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); // только у факта закупок
	ТЗ.Колонки.Добавить("Единица", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТЗ.Колонки.Добавить("Документ", Новый ОписаниеТипов(МассивДокумент));
	ТЗ.Колонки.Добавить("ПланЧасы", ОписЧисло);
	ТЗ.Колонки.Добавить("ФактЧасы", ОписЧисло);
	ТЗ.Колонки.Добавить("ВиконанняЧасы", ОписЧисло);
	ТЗ.Колонки.Добавить("ПланКол", ОписЧисло);
	ТЗ.Колонки.Добавить("ФактКол", ОписЧисло);
	ТЗ.Колонки.Добавить("ПланГрн", ОписЧисло);
	ТЗ.Колонки.Добавить("ФактГрн", ОписЧисло);
	ТЗ.Колонки.Добавить("ОтклонениеЧасы", ОписЧисло);
	ТЗ.Колонки.Добавить("ОтклонениеКол", ОписЧисло);
	ТЗ.Колонки.Добавить("ОтклонениеГрн", ОписЧисло);
	ТЗ.Колонки.Добавить("ПроцентЧасы", ОписЧисло);
	ТЗ.Колонки.Добавить("ПроцентКол", ОписЧисло);
	ТЗ.Колонки.Добавить("ПроцентГрн", ОписЧисло);
	ТЗ.Колонки.Добавить("ОтклонениеВиконання", ОписЧисло);
	ТЗ.Колонки.Добавить("ПроцентВиконання", ОписЧисло);
	ТЗ.Колонки.Добавить("ПроцентВиконанняФакт", ОписЧисло);
	ТЗ.Колонки.Добавить("ПланНаФактГрн", ОписЧисло);
	ТЗ.Колонки.Добавить("ПрогнозГрн", ОписЧисло);
	ТЗ.Колонки.Добавить("ОтклонениеПрогнозГрн", ОписЧисло);
	ТЗ.Колонки.Добавить("ПроцентПрогнозГрн", ОписЧисло);
	ТЗ.Колонки.Добавить("ЦенаПлан", ОписЧисло);
	ТЗ.Колонки.Добавить("ЦенаФакт", ОписЧисло);
	Возврат ТЗ;

КонецФункции

Функция ПолучитьЗначениеПараметра(Компоновщик, ИмяПараметра)
	Параметр = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(Компоновщик, ИмяПараметра);
	Возврат ?(Параметр = Неопределено, Неопределено, Параметр.Значение);
КонецФункции

Функция ПолучитьТаблицуКоманд()
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
